<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"a150c8e5c00d49184d60834c9b93e99a5ef254dd01838dde1ec960d592580399","plan_job_ref":"Job Terraform Plan #4 at https://github.com/thetheilred/test-eks/actions/runs/13098391881","plan_out_hash":"887e5372596b56b588569f18625ad99505bb69cb0dcdb43a93315807b96b3fbf","plan_hash":"7687b5fca5d5f9a0462355ff934ed13a487a854e098a8d99e1656ae679481dcf","plan_text_format":"diff","version":"1.46.1","closed":true} -->
Terraform plan in __terraform/eks__
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_s3_bucket.name will be created
+   resource "aws_s3_bucket" "name" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = "my-unique-bucket-name-359ff4f828c8d92ddb3563f386184906"
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = false
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = (known after apply)
+       policy                      = (known after apply)
+       region                      = (known after apply)
+       request_payer               = (known after apply)
+       tags                        = {
+           "Environment" = "Dev"
+           "Name"        = "My bucket"
        }
+       tags_all                    = {
+           "Environment" = "Dev"
+           "Name"        = "My bucket"
        }
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)

+       cors_rule (known after apply)

+       grant (known after apply)

+       lifecycle_rule (known after apply)

+       logging (known after apply)

+       object_lock_configuration (known after apply)

+       replication_configuration (known after apply)

+       server_side_encryption_configuration (known after apply)

+       versioning (known after apply)

+       website (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:white_check_mark: Plan applied in [Terraform apply #1](https://github.com/thetheilred/test-eks/actions/runs/13098402835)